### Lab 2 Data Wraggling

In [39]:
import pandas as pd
import matplotlib
import numpy as np

### 1 Data Exploration

In [40]:
#assign data
data = {'Name': ['Astik','Stik','Tik','Ik','K'],
        'Age': [20,19,18,17,24],
        'Gender': ['M','F','F','M','F'],
        'Marks':[90,75,'NaN',30,'NaN']}

df = pd.DataFrame(data)
df

    Name  Age Gender Marks
0  Astik   20      M    90
1   Stik   19      F    75
2    Tik   18      F   NaN
3     Ik   17      M    30
4      K   24      F   NaN

### 2 Dealing with missing value
##### null value replaced by mean value

In [41]:
#marks mean
c = avg = 0
for ele in df['Marks']:
    if str(ele).isnumeric():
        c += 1
        avg += ele
avg /= c

df = df.replace(to_replace='NaN',value=avg)
df

    Name  Age Gender  Marks
0  Astik   20      M   90.0
1   Stik   19      F   75.0
2    Tik   18      F   65.0
3     Ik   17      M   30.0
4      K   24      F   65.0

#### 3 Reshaping data
##### categorise values data in gender can be rshaped to numbers

In [42]:
df['Gender'] = df['Gender'].map({'M': 0, 'F': 1,}).astype(int)

df

    Name  Age  Gender  Marks
0  Astik   20       0   90.0
1   Stik   19       1   75.0
2    Tik   18       1   65.0
3     Ik   17       0   30.0
4      K   24       1   65.0

#### 4 Filtering
#### data restructured to specific format

In [43]:
#filter top scorers

df = df[df['Marks']>=75]
#removing age row
df = df.drop(["Age"],axis=1)
df

    Name  Gender  Marks
0  Astik       0   90.0
1   Stik       1   75.0